scripts/UC_2_buyItem/result1/Iteration10/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>Sophia454</ns2:safePayUsername><ns2:safePayPassword>0560155d120be7b95d29a0b0ff3e8205f3d60d7f</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886345678901234</ns2:cardNumber><ns2:expirationDate>032025</ns2:expirationDate><ns2:cvvNumber>412</ns2:cvvNumber><ns2:customerName>Sophia Anderson</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>